===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape
===================================================================================================================
├─Conv2d: 1-1                            [-1, 3, 240, 240]         [-1, 16, 119, 119]        [3, 16, 3, 3]
├─ACFF: 1-2                              [-1, 16, 119, 119]        [-1, 64, 117, 117]        --
|    └─Conv2d: 2-1                       [-1, 16, 119, 119]        [-1, 16, 117, 117]        [1, 16, 3, 3]
|    └─Conv2d: 2-2                       [-1, 16, 119, 119]        [-1, 16, 117, 117]        [1, 16, 3, 3]
|    └─Conv2d: 2-3                       [-1, 16, 119, 119]        [-1, 16, 117, 117]        [1, 16, 3, 3]
|    └─Conv2d: 2-4                       [-1, 48, 117, 117]        [-1, 64, 117, 117]        [48, 64, 1, 1]
|    └─LeakyReLU: 2-5                    [-1, 64, 117, 117]        [-1, 64, 117, 117]        --
|    └─BatchNorm2d: 2-6                  [-1, 64, 117, 117]        [-1, 64, 117, 117]        [64]
|    └─Dropout: 2-7                      [-1, 64, 117, 117]        [-1, 64, 117, 117]        --
├─MaxPool2d: 1-3                         [-1, 64, 117, 117]        [-1, 64, 58, 58]          --
├─ACFF: 1-4                              [-1, 64, 58, 58]          [-1, 96, 56, 56]          --
|    └─Conv2d: 2-8                       [-1, 64, 58, 58]          [-1, 64, 56, 56]          [1, 64, 3, 3]
|    └─Conv2d: 2-9                       [-1, 64, 58, 58]          [-1, 64, 56, 56]          [1, 64, 3, 3]
|    └─Conv2d: 2-10                      [-1, 64, 58, 58]          [-1, 64, 56, 56]          [1, 64, 3, 3]
|    └─Conv2d: 2-11                      [-1, 192, 56, 56]         [-1, 96, 56, 56]          [192, 96, 1, 1]
|    └─LeakyReLU: 2-12                   [-1, 96, 56, 56]          [-1, 96, 56, 56]          --
|    └─BatchNorm2d: 2-13                 [-1, 96, 56, 56]          [-1, 96, 56, 56]          [96]
|    └─Dropout: 2-14                     [-1, 96, 56, 56]          [-1, 96, 56, 56]          --
├─MaxPool2d: 1-5                         [-1, 96, 56, 56]          [-1, 96, 28, 28]          --
├─ACFF: 1-6                              [-1, 96, 28, 28]          [-1, 128, 26, 26]         --
|    └─Conv2d: 2-15                      [-1, 96, 28, 28]          [-1, 96, 26, 26]          [1, 96, 3, 3]
|    └─Conv2d: 2-16                      [-1, 96, 28, 28]          [-1, 96, 26, 26]          [1, 96, 3, 3]
|    └─Conv2d: 2-17                      [-1, 96, 28, 28]          [-1, 96, 26, 26]          [1, 96, 3, 3]
|    └─Conv2d: 2-18                      [-1, 288, 26, 26]         [-1, 128, 26, 26]         [288, 128, 1, 1]
|    └─LeakyReLU: 2-19                   [-1, 128, 26, 26]         [-1, 128, 26, 26]         --
|    └─BatchNorm2d: 2-20                 [-1, 128, 26, 26]         [-1, 128, 26, 26]         [128]
|    └─Dropout: 2-21                     [-1, 128, 26, 26]         [-1, 128, 26, 26]         --
├─MaxPool2d: 1-7                         [-1, 128, 26, 26]         [-1, 128, 13, 13]         --
├─ACFF: 1-8                              [-1, 128, 13, 13]         [-1, 128, 11, 11]         --
|    └─Conv2d: 2-22                      [-1, 128, 13, 13]         [-1, 128, 11, 11]         [1, 128, 3, 3]
|    └─Conv2d: 2-23                      [-1, 128, 13, 13]         [-1, 128, 11, 11]         [1, 128, 3, 3]
|    └─Conv2d: 2-24                      [-1, 128, 13, 13]         [-1, 128, 11, 11]         [1, 128, 3, 3]
|    └─Conv2d: 2-25                      [-1, 384, 11, 11]         [-1, 128, 11, 11]         [384, 128, 1, 1]
|    └─LeakyReLU: 2-26                   [-1, 128, 11, 11]         [-1, 128, 11, 11]         --
|    └─BatchNorm2d: 2-27                 [-1, 128, 11, 11]         [-1, 128, 11, 11]         [128]
|    └─Dropout: 2-28                     [-1, 128, 11, 11]         [-1, 128, 11, 11]         --
├─ACFF: 1-9                              [-1, 128, 11, 11]         [-1, 128, 9, 9]           --
|    └─Conv2d: 2-29                      [-1, 128, 11, 11]         [-1, 128, 9, 9]           [1, 128, 3, 3]
|    └─Conv2d: 2-30                      [-1, 128, 11, 11]         [-1, 128, 9, 9]           [1, 128, 3, 3]
|    └─Conv2d: 2-31                      [-1, 128, 11, 11]         [-1, 128, 9, 9]           [1, 128, 3, 3]
|    └─Conv2d: 2-32                      [-1, 384, 9, 9]           [-1, 128, 9, 9]           [384, 128, 1, 1]
|    └─LeakyReLU: 2-33                   [-1, 128, 9, 9]           [-1, 128, 9, 9]           --
|    └─BatchNorm2d: 2-34                 [-1, 128, 9, 9]           [-1, 128, 9, 9]           [128]
|    └─Dropout: 2-35                     [-1, 128, 9, 9]           [-1, 128, 9, 9]           --
├─ACFF: 1-10                             [-1, 128, 9, 9]           [-1, 256, 7, 7]           --
|    └─Conv2d: 2-36                      [-1, 128, 9, 9]           [-1, 128, 7, 7]           [1, 128, 3, 3]
|    └─Conv2d: 2-37                      [-1, 128, 9, 9]           [-1, 128, 7, 7]           [1, 128, 3, 3]
|    └─Conv2d: 2-38                      [-1, 128, 9, 9]           [-1, 128, 7, 7]           [1, 128, 3, 3]
|    └─Conv2d: 2-39                      [-1, 384, 7, 7]           [-1, 256, 7, 7]           [384, 256, 1, 1]
|    └─LeakyReLU: 2-40                   [-1, 256, 7, 7]           [-1, 256, 7, 7]           --
|    └─BatchNorm2d: 2-41                 [-1, 256, 7, 7]           [-1, 256, 7, 7]           [256]
|    └─Dropout: 2-42                     [-1, 256, 7, 7]           [-1, 256, 7, 7]           --
├─Conv2d: 1-11                           [-1, 256, 7, 7]           [-1, 5, 7, 7]             [256, 5, 1, 1]
├─AvgPool2d: 1-12                        [-1, 5, 7, 7]             [-1, 5, 3, 3]             --
├─Linear: 1-13                           [-1, 45]                  [-1, 5]                   [45, 5]
├─Softmax: 1-14                          [-1, 5]                   [-1, 5]                   --
===================================================================================================================
Total params: 276,118
Trainable params: 276,118
Non-trainable params: 0
Total mult-adds (M): 159.93
===================================================================================================================
Input size (MB): 0.66
Forward/backward pass size (MB): 33.43
Params size (MB): 1.05
Estimated Total Size (MB): 35.14
===================================================================================================================
