===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape
===================================================================================================================
├─Conv2d: 1-1                            [-1, 3, 140, 140]         [-1, 16, 69, 69]          [3, 16, 3, 3]
├─Conv2d: 1-2                            [-1, 16, 69, 69]          [-1, 8, 69, 69]           [16, 8, 1, 1]
├─ACFF: 1-3                              [-1, 8, 69, 69]           [-1, 64, 67, 67]          --
|    └─Conv2d: 2-1                       [-1, 8, 69, 69]           [-1, 8, 67, 67]           [1, 8, 3, 3]
|    └─Conv2d: 2-2                       [-1, 8, 69, 69]           [-1, 8, 67, 67]           [1, 8, 3, 3]
|    └─Conv2d: 2-3                       [-1, 8, 69, 69]           [-1, 8, 67, 67]           [1, 8, 3, 3]
|    └─Conv2d: 2-4                       [-1, 24, 67, 67]          [-1, 64, 67, 67]          [24, 64, 1, 1]
|    └─LeakyReLU: 2-5                    [-1, 64, 67, 67]          [-1, 64, 67, 67]          --
|    └─BatchNorm2d: 2-6                  [-1, 64, 67, 67]          [-1, 64, 67, 67]          [64]
|    └─Dropout: 2-7                      [-1, 64, 67, 67]          [-1, 64, 67, 67]          --
├─MaxPool2d: 1-4                         [-1, 64, 67, 67]          [-1, 64, 33, 33]          --
├─ACFF: 1-5                              [-1, 64, 33, 33]          [-1, 96, 31, 31]          --
|    └─Conv2d: 2-8                       [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-9                       [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-10                      [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-11                      [-1, 192, 31, 31]         [-1, 96, 31, 31]          [192, 96, 1, 1]
|    └─LeakyReLU: 2-12                   [-1, 96, 31, 31]          [-1, 96, 31, 31]          --
|    └─BatchNorm2d: 2-13                 [-1, 96, 31, 31]          [-1, 96, 31, 31]          [96]
|    └─Dropout: 2-14                     [-1, 96, 31, 31]          [-1, 96, 31, 31]          --
├─Conv2d: 1-6                            [-1, 96, 31, 31]          [-1, 48, 31, 31]          [96, 48, 1, 1]
├─MaxPool2d: 1-7                         [-1, 48, 31, 31]          [-1, 48, 15, 15]          --
├─ACFF: 1-8                              [-1, 48, 15, 15]          [-1, 128, 13, 13]         --
|    └─Conv2d: 2-15                      [-1, 48, 15, 15]          [-1, 48, 13, 13]          [1, 48, 3, 3]
|    └─Conv2d: 2-16                      [-1, 48, 15, 15]          [-1, 48, 13, 13]          [1, 48, 3, 3]
|    └─Conv2d: 2-17                      [-1, 48, 15, 15]          [-1, 48, 13, 13]          [1, 48, 3, 3]
|    └─Conv2d: 2-18                      [-1, 144, 13, 13]         [-1, 128, 13, 13]         [144, 128, 1, 1]
|    └─LeakyReLU: 2-19                   [-1, 128, 13, 13]         [-1, 128, 13, 13]         --
|    └─BatchNorm2d: 2-20                 [-1, 128, 13, 13]         [-1, 128, 13, 13]         [128]
|    └─Dropout: 2-21                     [-1, 128, 13, 13]         [-1, 128, 13, 13]         --
├─MaxPool2d: 1-9                         [-1, 128, 13, 13]         [-1, 128, 6, 6]           --
├─Conv2d: 1-10                           [-1, 128, 6, 6]           [-1, 64, 6, 6]            [128, 64, 1, 1]
├─ACFF: 1-11                             [-1, 64, 6, 6]            [-1, 256, 4, 4]           --
|    └─Conv2d: 2-22                      [-1, 64, 6, 6]            [-1, 64, 4, 4]            [1, 64, 3, 3]
|    └─Conv2d: 2-23                      [-1, 64, 6, 6]            [-1, 64, 4, 4]            [1, 64, 3, 3]
|    └─Conv2d: 2-24                      [-1, 64, 6, 6]            [-1, 64, 4, 4]            [1, 64, 3, 3]
|    └─Conv2d: 2-25                      [-1, 192, 4, 4]           [-1, 256, 4, 4]           [192, 256, 1, 1]
|    └─LeakyReLU: 2-26                   [-1, 256, 4, 4]           [-1, 256, 4, 4]           --
|    └─BatchNorm2d: 2-27                 [-1, 256, 4, 4]           [-1, 256, 4, 4]           [256]
|    └─Dropout: 2-28                     [-1, 256, 4, 4]           [-1, 256, 4, 4]           --
├─Conv2d: 1-12                           [-1, 256, 4, 4]           [-1, 5, 4, 4]             [256, 5, 1, 1]
├─AvgPool2d: 1-13                        [-1, 5, 4, 4]             [-1, 5, 2, 2]             --
├─Linear: 1-14                           [-1, 20]                  [-1, 5]                   [20, 5]
├─Softmax: 1-15                          [-1, 5]                   [-1, 5]                   --
===================================================================================================================
Total params: 109,569
Trainable params: 109,569
Non-trainable params: 0
Total mult-adds (M): 38.89
===================================================================================================================
Input size (MB): 0.22
Forward/backward pass size (MB): 9.86
Params size (MB): 0.42
Estimated Total Size (MB): 10.51
===================================================================================================================
