===================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape
===================================================================================================================
├─Conv2d: 1-1                            [-1, 3, 140, 140]         [-1, 16, 69, 69]          [3, 16, 3, 3]
├─ACFF: 1-2                              [-1, 16, 69, 69]          [-1, 64, 67, 67]          --
|    └─Conv2d: 2-1                       [-1, 16, 69, 69]          [-1, 16, 67, 67]          [1, 16, 3, 3]
|    └─Conv2d: 2-2                       [-1, 16, 69, 69]          [-1, 16, 67, 67]          [1, 16, 3, 3]
|    └─Conv2d: 2-3                       [-1, 16, 69, 69]          [-1, 16, 67, 67]          [1, 16, 3, 3]
|    └─Conv2d: 2-4                       [-1, 48, 67, 67]          [-1, 64, 67, 67]          [48, 64, 1, 1]
|    └─LeakyReLU: 2-5                    [-1, 64, 67, 67]          [-1, 64, 67, 67]          --
|    └─BatchNorm2d: 2-6                  [-1, 64, 67, 67]          [-1, 64, 67, 67]          [64]
|    └─Dropout: 2-7                      [-1, 64, 67, 67]          [-1, 64, 67, 67]          --
├─MaxPool2d: 1-3                         [-1, 64, 67, 67]          [-1, 64, 33, 33]          --
├─ACFF: 1-4                              [-1, 64, 33, 33]          [-1, 96, 31, 31]          --
|    └─Conv2d: 2-8                       [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-9                       [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-10                      [-1, 64, 33, 33]          [-1, 64, 31, 31]          [1, 64, 3, 3]
|    └─Conv2d: 2-11                      [-1, 192, 31, 31]         [-1, 96, 31, 31]          [192, 96, 1, 1]
|    └─LeakyReLU: 2-12                   [-1, 96, 31, 31]          [-1, 96, 31, 31]          --
|    └─BatchNorm2d: 2-13                 [-1, 96, 31, 31]          [-1, 96, 31, 31]          [96]
|    └─Dropout: 2-14                     [-1, 96, 31, 31]          [-1, 96, 31, 31]          --
├─MaxPool2d: 1-5                         [-1, 96, 31, 31]          [-1, 96, 15, 15]          --
├─ACFF: 1-6                              [-1, 96, 15, 15]          [-1, 128, 13, 13]         --
|    └─Conv2d: 2-15                      [-1, 96, 15, 15]          [-1, 96, 13, 13]          [1, 96, 3, 3]
|    └─Conv2d: 2-16                      [-1, 96, 15, 15]          [-1, 96, 13, 13]          [1, 96, 3, 3]
|    └─Conv2d: 2-17                      [-1, 96, 15, 15]          [-1, 96, 13, 13]          [1, 96, 3, 3]
|    └─Conv2d: 2-18                      [-1, 288, 13, 13]         [-1, 128, 13, 13]         [288, 128, 1, 1]
|    └─LeakyReLU: 2-19                   [-1, 128, 13, 13]         [-1, 128, 13, 13]         --
|    └─BatchNorm2d: 2-20                 [-1, 128, 13, 13]         [-1, 128, 13, 13]         [128]
|    └─Dropout: 2-21                     [-1, 128, 13, 13]         [-1, 128, 13, 13]         --
├─MaxPool2d: 1-7                         [-1, 128, 13, 13]         [-1, 128, 6, 6]           --
├─ACFF: 1-8                              [-1, 128, 6, 6]           [-1, 256, 4, 4]           --
|    └─Conv2d: 2-22                      [-1, 128, 6, 6]           [-1, 128, 4, 4]           [1, 128, 3, 3]
|    └─Conv2d: 2-23                      [-1, 128, 6, 6]           [-1, 128, 4, 4]           [1, 128, 3, 3]
|    └─Conv2d: 2-24                      [-1, 128, 6, 6]           [-1, 128, 4, 4]           [1, 128, 3, 3]
|    └─Conv2d: 2-25                      [-1, 384, 4, 4]           [-1, 256, 4, 4]           [384, 256, 1, 1]
|    └─LeakyReLU: 2-26                   [-1, 256, 4, 4]           [-1, 256, 4, 4]           --
|    └─BatchNorm2d: 2-27                 [-1, 256, 4, 4]           [-1, 256, 4, 4]           [256]
|    └─Dropout: 2-28                     [-1, 256, 4, 4]           [-1, 256, 4, 4]           --
├─Conv2d: 1-9                            [-1, 256, 4, 4]           [-1, 5, 4, 4]             [256, 5, 1, 1]
├─AvgPool2d: 1-10                        [-1, 5, 4, 4]             [-1, 5, 2, 2]             --
├─Linear: 1-11                           [-1, 20]                  [-1, 5]                   [20, 5]
├─Softmax: 1-12                          [-1, 5]                   [-1, 5]                   --
===================================================================================================================
Total params: 169,241
Trainable params: 169,241
Non-trainable params: 0
Total mult-adds (M): 45.64
===================================================================================================================
Input size (MB): 0.22
Forward/backward pass size (MB): 10.24
Params size (MB): 0.65
Estimated Total Size (MB): 11.11
===================================================================================================================
